openfoam/OpenFOAM-dev/tutorials/multicomponentFluid/lockExchange/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.sludge;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multicomponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species (water sludge);

defaultSpecie water;

water
{
    specie
    {
        molWeight   18;
    }
    equationOfState
    {
        rho         990;
    }
    thermodynamics
    {
        Cp          4195;
        hf          0;
    }
    transport
    {
        mu          0.99e-3;
        Pr          1.0;
    }
}

sludge
{
    specie
    {
        molWeight   18;
    }
    equationOfState
    {
        rho         1000;
    }
    thermodynamics
    {
        Cp          4195;
        hf          0;
    }
    transport
    {
        mu          1e-3;
        Pr          1.0;
    }
}

// ************************************************************************* //
